ams/src/Documents/AMS_ПроизводствоФабриката/AMS_ПроизводствоФабриката.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>AMS_ПроизводствоФабриката</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Фабрикаты</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Спецификация</name>
      <type>
        <types>CatalogRef._ВариантыСпецификацийНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МатериалыФабриката</name>
    <attributes>
      <name>Фабрикат</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ams/src/Enums/AMS_Права/AMS_Права.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>AMS_Права</name>
  <enumValues>
    <name>СозданиеДоговораПоставки</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеСпецификацийВДокументеПроизводствоЗаСмену</name>
  </enumValues>
  <enumValues>
    <name>ПроведениеРеализацииБезОграничений</name>
  </enumValues>
  <enumValues>
    <name>Продукция_ПроизводствоПередача</name>
    <comment>Полный доступ к документу &quot;Производство за смену&quot;</comment>
  </enumValues>
  <enumValues>
    <name>Продукция_ПередачаНаСклад</name>
    <comment>Документ &quot;Производство за смену&quot;: ввод произведенного и передеча на склад</comment>
  </enumValues>
  <enumValues>
    <name>РазрешитьИзменятьЦены</name>
  </enumValues>
  <enumValues>
    <name>Устанавливать_MIN_MAX_Запасы</name>
  </enumValues>
  <enumValues>
    <name>УтверждатьПланПроизводства</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДоговораЗаРуководителя</name>
  </enumValues>
</mdclass:Enum>

ams/src/Enums/AMS_ОперацииПроизводства/AMS_ОперацииПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>AMS_ОперацииПроизводства</name>
  <enumValues>
    <name>ПеремещениеМатериаловВПроизводство</name>
  </enumValues>
  <enumValues>
    <name>ПроизводствоФабрикатов</name>
  </enumValues>
  <enumValues>
    <name>ПроизводствоПродукции</name>
  </enumValues>
  <enumValues>
    <name>СписаниеМатериаловСПроизводства</name>
  </enumValues>
  <enumValues>
    <name>СписаниеФабрикатаСПроизводства</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеБракаВЦех</name>
    <comment>Перемещение брака в цех (из склада бракованной продукции)</comment>
  </enumValues>
  <enumValues>
    <name>СписаниеБракаВЦехе</name>
  </enumValues>
  <enumValues>
    <name>СписаниеБракаВЦехеОрдер</name>
  </enumValues>
  <enumValues>
    <name>ОприходованиеМатериаловИзБрака</name>
  </enumValues>
  <enumValues>
    <name>ОприходованиеМатериаловИзБракаОрдер</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеМатериаловВПереработку</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеМатериаловНаПереработкуБрака</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеМатериаловБракаВОтходы</name>
  </enumValues>
  <enumValues>
    <name>СписаниеМатериаловНаПереработкуБрака</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеПроизведеннойПродукции</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеПослеКорректировки</name>
  </enumValues>
  <enumValues>
    <name>ПроизводствоПродукцииИзБрака</name>
  </enumValues>
  <enumValues>
    <name>ПроизводствоФлаконов</name>
  </enumValues>
  <enumValues>
    <name>ПриемИзПереработки</name>
    <comment>Прием из переработки (давальческого сырья)</comment>
  </enumValues>
</mdclass:Enum>

ams/src/Catalogs/_ВариантыСпецификацийНоменклатуры/_ВариантыСпецификацийНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>_ВариантыСпецификацийНоменклатуры</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоУпаковок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef._СтатусыСпецификаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основной</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопускНаЗамес</name>
    <comment>Допустимое отклонение от нормы в одном замесе</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДопускНаУпаковку</name>
    <comment>Допустимое отклонение от нормы в одном замесе</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПереработкаБрака</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ams/src/Documents/AMS_ПроизводствоФабриката/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если Не AMS_ВызовСервера.ЕстьПравоАМС(ПредопределенноеЗначение("Перечисление.AMS_Права.Продукция_ПроизводствоПередача")) Тогда
		Возврат;
	КонецЕсли;
	
	Если ПометкаУдаления Тогда
		Табл = AMS_Сервер.ПолучитьДокументыПроизводстваФабриката(Ссылка);
		
		Для каждого Стр Из Табл Цикл
			мср.УстановитьПометкуУдаленияДокументу(Стр.Ссылка, Истина);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Организация   = AMS_ВызовСервера.ПолучитьОсновнуюОрганизацию();
	Склад         = AMS_ВызовСервера.ПолучитьСвойСклад();
	Ответственный = Пользователи.ТекущийПользователь();
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Табл = AMS_Сервер.ПолучитьДокументыПроизводстваФабриката(Ссылка);
	
	Если Проведен Тогда
		ОформитьПроизводствоФабриката(Табл, Отказ);
		ОформитьСписаниеМатериалов(Табл, Отказ);
		
	Иначе
		Для каждого Стр Из Табл Цикл 
			Если Стр.Проведен Тогда
				мср.ЗаписатьДокумент(Стр.Ссылка, РежимЗаписиДокумента.ОтменаПроведения,Отказ);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОформитьПроизводствоФабриката(ТабДокументов, Отказ)
	Товары = ПолучитьПроизводствоФабриката();
	
	Стр = ТабДокументов.Найти(Перечисления.AMS_ОперацииПроизводства.ПроизводствоФабрикатов);
	
	Если Товары.Количество() > 0 Тогда 
		Если Стр = Неопределено Тогда 
			Док = Документы.ПрочееОприходованиеТоваров.СоздатьДокумент();
		Иначе 
			Док = Стр.Ссылка.ПолучитьОбъект();
			Если Стр.ПометкаУдаления Тогда
				Док.УстановитьПометкуУдаления(Ложь);
			КонецЕсли;
		КонецЕсли;

		Док.Дата                  = Дата;
		Док.Организация           = Организация;
		Док.Склад                 = Склад;
		Док.ВидЦены               = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Склад, "УчетныйВидЦены");
		Док.Подразделение         = мср.СоответствиеЦехПодразделение().Получить(Склад);
		Док.Ответственный         = Ответственный;
		Док.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоступлениеИзПроизводства;
		Док.Валюта                = Константы.ВалютаУправленческогоУчета.Получить();
		Док.ВариантПриемкиТоваров = Перечисления.ВариантыПриемкиТоваров.РазделенаПоЗаказамИНакладным;
		Док.Комментарий           = "Сформирован автоматичестки. Производство фабриката №"
										+ Номер + " от " + Формат(Дата, "ДЛФ=Д") + " г.";

		Док._Основание                = Ссылка;
		Док._ОперацияПроизводства     = Перечисления.AMS_ОперацииПроизводства.ПроизводствоФабрикатов;

		Док.Товары.Загрузить(Товары);

		мср.ЗаписатьДокумент(Док, РежимЗаписиДокумента.Проведение, Отказ, Истина);

	Иначе // нет товара
		Если Не Стр = Неопределено И ЗначениеЗаполнено(Стр.Ссылка) Тогда
			мср.УстановитьПометкуУдаленияДокументу(Стр.Ссылка, Истина);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьПроизводствоФабриката()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Подразделение", мср.СоответствиеЦехПодразделение().Получить(Склад));
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("ВидЗапасов", ПолучитьВидЗапасов());
	Запрос.УстановитьПараметр("ВидыНоменклатуры", AMS_ВызовСервера.ВидыНоменклатурыФабрикаты());
	Запрос.УстановитьПараметр("СтатьяРасходов", ПланыВидовХарактеристик.СтатьиРасходов.НайтиПоКоду("01-000081"));

	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	т.Количество КАК Количество,
	|	т.Цена КАК Цена
	|ПОМЕСТИТЬ ф
	|ИЗ
	|	Документ.AMS_ПроизводствоФабриката.Фабрикаты КАК т
	|ГДЕ
	|	т.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ф.Номенклатура КАК Номенклатура,
	|	ф.Количество КАК Количество,
	|	ф.Цена КАК Цена,
	|	ф.Количество * ф.Цена КАК Сумма,
	|	Ном.Наименование КАК Наименование
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	ф КАК ф
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|		ПО ф.Номенклатура = Ном.Ссылка
	|ГДЕ
	|	Ном.ВидНоменклатуры В(&ВидыНоменклатуры)
	|	И ф.Количество > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт.Номенклатура КАК Номенклатура,
	|	т.КлючАналитики КАК КлючАналитики
	|ПОМЕСТИТЬ АналНом
	|ИЗ
	|	вт КАК вт
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК т
	|		ПО вт.Номенклатура = т.Номенклатура
	|			И (т.МестоХранения = &Склад)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Подразделение КАК АналитикаРасходов,
	|	ИСТИНА КАК АналитикаРасходовОбязательна,
	|	АналНом.КлючАналитики КАК АналитикаУчетаНоменклатуры,
	|	&ВидЗапасов КАК ВидЗапасов,
	|	вт.Количество КАК Количество,
	|	вт.Количество КАК КоличествоУпаковок,
	|	вт.Номенклатура КАК Номенклатура,
	|	0 КАК СтатусУказанияСерий,
	|	&СтатьяРасходов КАК СтатьяРасходовДоходов,
	|	вт.Сумма КАК Сумма,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар) КАК ТипНоменклатуры,
	|	1 КАК ТипСтатьи,
	|	вт.Цена КАК Цена
	|ИЗ
	|	вт КАК вт
	|		ЛЕВОЕ СОЕДИНЕНИЕ АналНом КАК АналНом
	|		ПО вт.Номенклатура = АналНом.Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	вт.Наименование";

	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Процедура ОформитьСписаниеМатериалов(ТабДокументов, Отказ)
	Товары = ПолучитьСписаниеМатериалов();
	
	Стр = ТабДокументов.Найти(Перечисления.AMS_ОперацииПроизводства.СписаниеМатериаловСПроизводства);
	
	Если Товары.Количество() > 0 Тогда 
		Если Стр = Неопределено Тогда 
			Док = Документы.ВнутреннееПотребление.СоздатьДокумент();
		Иначе 
			Док = Стр.Ссылка.ПолучитьОбъект();
			Если Стр.ПометкаУдаления Тогда
				Док.УстановитьПометкуУдаления(Ложь);
			КонецЕсли;
		КонецЕсли;

		Док.Дата                  = Дата + 360;
		Док.Организация           = Организация;
		Док.Склад                 = Склад;
		Док.Подразделение         = мср.СоответствиеЦехПодразделение().Получить(Склад);
		Док.Ответственный         = Ответственный;
		Док.ВидЦены               = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Склад, "УчетныйВидЦены");
		Док.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеТоваровПоТребованию;
		Док.Комментарий           = "Сформирован автоматичестки. Списание материалов на производство фабриката. Производство фабриката №"
									+ Номер + " от " + Формат(Дата, "ДЛФ=Д") + " г.";

		Док._Основание                = Ссылка;
		Док._ОперацияПроизводства     = Перечисления.AMS_ОперацииПроизводства.СписаниеМатериаловСПроизводства;

		Док.Товары.Загрузить(Товары);

		мср.ЗаписатьДокумент(Док, РежимЗаписиДокумента.Проведение, Отказ, Истина);

	Иначе // нет товара
		Если Не Стр = Неопределено И ЗначениеЗаполнено(Стр.Ссылка) Тогда
			мср.УстановитьПометкуУдаленияДокументу(Стр.Ссылка, Истина);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьСписаниеМатериалов()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("ВидыНоменклатуры", AMS_ВызовСервера.ВидыНоменклатурыФабрикаты());
	Запрос.УстановитьПараметр("СтатьяРасходов", ПланыВидовХарактеристик.СтатьиРасходов.НайтиПоКоду("01-000082"));
	Запрос.УстановитьПараметр("АналитикаРасходов", Справочники.ПрочиеРасходы.НайтиПоНаименованию("Материалы в производство", Истина));

	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	т.Спецификация КАК Спецификация,
	|	т.Количество КАК Количество
	|ПОМЕСТИТЬ ф
	|ИЗ
	|	Документ.AMS_ПроизводствоФабриката.Фабрикаты КАК т
	|ГДЕ
	|	т.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СпецТ.Номенклатура КАК Номенклатура,
	|	СУММА(СпецТ.Количество * ф.Количество / СпецД.Количество) КАК Количество,
	|	1 КАК ТипМатериала
	|ПОМЕСТИТЬ фм
	|ИЗ
	|	ф КАК ф
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник._ВариантыСпецификацийНоменклатуры КАК СпецД
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник._ВариантыСпецификацийНоменклатуры.Товары КАК СпецТ
	|			ПО СпецД.Ссылка = СпецТ.Ссылка
	|		ПО ф.Спецификация = СпецД.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|		ПО (СпецТ.Номенклатура = Ном.Ссылка)
	|ГДЕ
	|	НЕ СпецТ.Номенклатура.Код = ""01-00000017""
	|	И НЕ Ном.ВидНоменклатуры В (&ВидыНоменклатуры)
	|
	|СГРУППИРОВАТЬ ПО
	|	СпецТ.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	фм.Номенклатура КАК Номенклатура,
	|	фм.Количество КАК Количество,
	|	фм.Количество КАК КоличествоУпаковок,
	|	Ном.ТипНоменклатуры КАК ТипНоменклатуры,
	|	Ном.Наименование КАК Наименование,
	|	фм.ТипМатериала КАК ТипМатериала
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	фм КАК фм
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|		ПО фм.Номенклатура = Ном.Ссылка
	|ГДЕ
	|	фм.Количество > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт.Номенклатура КАК Номенклатура,
	|	вт.Количество КАК Количество,
	|	вт.КоличествоУпаковок КАК КоличествоУпаковок,
	|	&СтатьяРасходов КАК СтатьяРасходов,
	|	&АналитикаРасходов КАК АналитикаРасходов,
	|	вт.ТипНоменклатуры КАК ТипНоменклатуры,
	|	АналНом.КлючАналитики КАК АналитикаУчетаНоменклатуры,
	|	1 КАК ТипСтатьи
	|ИЗ
	|	вт КАК вт
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналНом
	|		ПО вт.Номенклатура = АналНом.Номенклатура
	|			И (АналНом.МестоХранения = &Склад)
	|
	|УПОРЯДОЧИТЬ ПО
	|	вт.ТипМатериала,
	|	вт.Наименование";

	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Функция ПолучитьВидЗапасов()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВидыЗапасов.Ссылка КАК ВидЗапасов
	|ИЗ
	|	Справочник.ВидыЗапасов КАК ВидыЗапасов
	|ГДЕ
	|	ВидыЗапасов.Организация = &Организация
	|	И ВидыЗапасов.Контрагент = НЕОПРЕДЕЛЕНО";

	Рез = Запрос.Выполнить();
	Выб = Рез.Выбрать();
	Выб.Следующий();
	Возврат Выб.ВидЗапасов;
КонецФункции

#КонецОбласти

#КонецЕсли
